In [83]:
import pandas as pd
import numpy as np

In [63]:
user_info=pd.read_csv('cse.tsv',delimiter='\t',encoding='utf-8')

In [66]:
user_info.rename(columns={'ID':'token',
                          'TEXT':'english',
                          'Unnamed: 2':'bangla','Unnamed: 3':'none'
                         }, 
                 inplace=True)

In [67]:
user_info.head(10)

,token,english,bangla,none
0,1000092795.jpg#0,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...,NaN
1,1000092795.jpg#1,"Two young , White males are outside near many ...",NaN,NaN
2,1000092795.jpg#2,Two men in green shirts are standing in a yard .,NaN,NaN
3,1000092795.jpg#3,A man in a blue shirt standing in a garden .,NaN,NaN
4,1000092795.jpg#4,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।,NaN
5,10002456.jpg#0,Several men in hard hats are operating a giant...,NaN,NaN
6,10002456.jpg#1,Workers look down from up above on a piece of ...,NaN,NaN
7,10002456.jpg#2,Two men working on a machine wearing hard hats .,NaN,NaN
8,10002456.jpg#3,Four men on top of a tall structure .,NaN,NaN
9,10002456.jpg#4,Three men on a large rig .,NaN,NaN

In [91]:
df1=user_info['english']

In [92]:
df2=user_info['bangla']

In [94]:
df1.head()

0    Two young guys with shaggy hair look at their ...
1    Two young , White males are outside near many ...
2     Two men in green shirts are standing in a yard .
3         A man in a blue shirt standing in a garden .
4              Two friends enjoy time spent together .
Name: english, dtype: object

In [69]:
int(df[1][1:-6])

92795

In [79]:
li=[]
for i in df:
    k= i[ :-6]
    p = int(k)
    li.append(p)
    if "." in k:
        print(k)

In [123]:
df3 = pd.DataFrame(np.array(li).reshape(len(li),1))

In [124]:
df3.columns = ['token']

In [125]:
df3.head()

        token
0  1000092795
1  1000092795
2  1000092795
3  1000092795
4  1000092795

In [126]:
df=pd.concat([df3, df1,df2], axis=1)

In [127]:
df.head()

,token,english,bangla
0,1000092795,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1,1000092795,"Two young , White males are outside near many ...",NaN
2,1000092795,Two men in green shirts are standing in a yard .,NaN
3,1000092795,A man in a blue shirt standing in a garden .,NaN
4,1000092795,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।

In [134]:
df.head()

,token,english,bangla
0,1000092795,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1,1000092795,"Two young , White males are outside near many ...",NaN
2,1000092795,Two men in green shirts are standing in a yard .,NaN
3,1000092795,A man in a blue shirt standing in a garden .,NaN
4,1000092795,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।

In [132]:
final=df.sort_values(by=['token'])

In [144]:
df = pd.DataFrame(final, columns= ['token', 'english','bangla'])

In [151]:
df.to_csv('token_jumar.csv',index=False)